tutorials/verificationAndValidation/turbulenceModels/planeChannel/setups.orig/common/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (17.54519653746177 0 0);

boundaryField
{
    "(bottom|top)"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "(inlet|outlet)"
    {
        type            cyclic;
    }

    leftAndRight
    {
        type            empty;
    }
}


// ************************************************************************* //
